lutfullah2011/My-Embedded-Experiences/My Embedded Applications/STM32Cube IDE/000_MY_DRIVERS_000/Src/stm32f100xx_i2c.c
/*
 * stm32f100xx_i2c.c
 *
 *  Created on: 12 Oca 2023
 *      Author: lutfullah_aydin
 */


/******************************************************************************/
/*                  ##### I2C Peripheral Module Driver #####	              */
/******************************************************************************/



#include "stm32f100xx_i2c.h"


static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx);
static void I2C_AddressWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_AddressRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle );
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle );



static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= ( 1 << I2C_CR1_START);
}


static void I2C_AddressWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr &= ~(1); //SlaveAddr is Slave address + r/nw bit=0
	pI2Cx->DR = SlaveAddr;
}


static void I2C_AddressRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
	SlaveAddr = SlaveAddr << 1;
	SlaveAddr |= 1; //SlaveAddr is Slave address + r/nw bit=1
	pI2Cx->DR = SlaveAddr;
}

static void I2C_ClearADDRFlag(I2C_Handle_t *pI2CHandle )
{
	uint32_t dummy_read;
	//check for device mode
	if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL)) //MSL: Slave mode:0, Master Mode:1
	{
		//Master mode
		if(pI2CHandle->TxRxState == I2C_BUSY_RX)
		{
			if(pI2CHandle->RxSize  == 1)
			{
				//first disable the ack
				I2C_ManageAcking(pI2CHandle->pI2Cx,DISABLE);

				//clear the ADDR flag ( read SR1 first then read SR2)
				dummy_read = pI2CHandle->pI2Cx->SR1;
				dummy_read = pI2CHandle->pI2Cx->SR2;
				(void)dummy_read; //Doing this to handle unused warning
			}

		}
		else
		{
			//clear the ADDR flag ( read SR1 first then read SR2)
			dummy_read = pI2CHandle->pI2Cx->SR1;
			dummy_read = pI2CHandle->pI2Cx->SR2;
			(void)dummy_read; // Doing this cause giving dummy error:))

		}

	}
	else
	{
		//If device is in Slave Mode
		//clear the ADDR flag ( read SR1 first then read SR2)
		dummy_read = pI2CHandle->pI2Cx->SR1;
		dummy_read = pI2CHandle->pI2Cx->SR2;
		(void)dummy_read;
	}


}


/*
 * If the applicaiton wants to release the bus, we can use this API
 * The bit is set and cleared by software, cleared by hardware when a Stop condition is
 * detected, set by hardware when a timeout error is detected.
 * In Master Mode:
 * 	   0: No Stop generation.
 * 	   1: Stop generation after the current byte transfer or after the current Start condition is sent.
 * In Slave mode:
 * 	   0: No Stop generation.
 * 	   1: Release the SCL and SDA lines after the current byte transfer.
 */
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
	pI2Cx->CR1 |= ( 1 << I2C_CR1_STOP);
}


/*
 * Peripheral Clock Setup
 * I used only I2C1, So it is simple.
 */
void I2C_PCLK(I2C_RegDef_t *pI2Cx, uint8_t EnorDis)
{

	  if (EnorDis != DISABLE)
	  {
		  I2C1_PCLK_EN();
	  }else
	  {
		  I2C1_PCLK_DIS();
	  }
}


/***************************************************************************************/

void RCCPLLOutputClock(void)
{
	//Created for RCC_GetPCLC1Value(void) function. Not implemented cause we dont use PLL for now.
}

uint16_t AHB_PreScaler[9] = {2,4,8,16,32,64,128,256,512};
uint8_t APB1_PreScaler[4] = {2,4,8,16,};
/*
 * Generating PERIPH CLOCK value
 */
uint32_t RCC_GetPCLK1Value(void) // Verify this function from Datasheet & Reference Man
{
	uint32_t pclk1, SystemClk;
	uint16_t ahbp;//AHB Prescaler
	uint8_t clksrc, temp, apb1p; //AHB Prescaler, APB1 Prescaler

	clksrc = ((RCC->CFGR >> 2) & 0x3); // Bringing those 2 bits to lsb position and mask
	if(clksrc == 0) // Look at the reference manual
	{
		SystemClk = 8000000;
	}else if(clksrc == 1)
	{
		SystemClk = 4000000;
	}else if(clksrc == 2)
	{
		//SystemClk = RCCPLLOutputClock();
	}


	//For AHB
	temp = ((RCC->CFGR >> 4) & 0xF); // Bringing those 4 bits to lsb position and mask
	if(temp < 8) // Look at the reference manual
	{
		ahbp = 1;
	}else
	{
		ahbp = AHB_PreScaler[temp-8];
	}

	//For APB1
	temp = ((RCC->CFGR >> 8) & 0x7); // Bringing those 3 bits to lsb position and mask
	if(temp < 4) // Look at the reference manual
	{
		apb1p = 1;
	}else
	{
		ahbp = APB1_PreScaler[temp-4];
	}

	pclk1 = (SystemClk / ahbp) / apb1p;


	return pclk1;
}

/***************************************************************************************/


/*
 * I2C Peripheral Enable or Disable Configuration API
 */
void I2C_PeriphControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDis)
{
	  if (EnorDis != DISABLE)
	  {
		  pI2Cx->CR1 |= (1 << I2C_CR1_PE);

	  }else
	  {
		  pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
	  }
}



/*
 * Initializes the I2Cx with the pI2CHandle.
 *
 * 1. Configuring the Mode(Standart or Fast)
 * 2. Configuring the Speed of the Serial Clock(SCL) (Use CR2(FREQ) and CCR)
 * 3. Configuring the Device Address(When device is slave)
 * 4. Enable the Acking(Disable by default)
 * 5. Configure the rise time for I2C pin(Time required for signal from GND to Vcc)
 *
 * All the above Configurations must be done When I2C Peripheral Disable in CR1
 */
void I2C_Init(I2C_Handle_t *pI2CHandle)
{

	//Enable the Clock first .  //I configured this setting inside the Init function because user could forget to enable the clock:)
	I2C_PCLK(pI2CHandle->pI2Cx, ENABLE);

	uint32_t tempreg;

	/**************************	I2C_CR1 Configuration *******************************/

	//Ack bit, Ack bit can be set only after I2C PE is 1.
	tempreg = 0;
	tempreg |= pI2CHandle->I2CConfig.I2C_ACK << I2C_CR1_ACK;
	pI2CHandle->pI2Cx->CR1 = tempreg;

	/**************************	I2C_CR2 Configuration *******************************/

	//FREQ Bit of Config
	tempreg = 0;
	tempreg |= RCC_GetPCLK1Value() / 1000000U; // 8 MHz diveded by , we only want 8 here.
	pI2CHandle->pI2Cx->CR2 = (tempreg & 0x3F); // Masking last 5 bit

	/**************************	I2C_OAR1 Configuration *******************************/

	//Store the device own address (When it is slave)
	tempreg = 0;
	tempreg |= pI2CHandle->I2CConfig.I2C_DeviceAddress << I2C_OAR1_ADD71;
	tempreg |= (1 << I2C_OAR1_BIT14); // In Reference Manual, 14th bit should always kept 1 by software.
	pI2CHandle->pI2Cx->OAR1 = tempreg;

	/**************************	I2C_CCR Configuration *******************************/

	uint16_t ccr_value = 0;
	tempreg = 0;
	if(pI2CHandle->I2CConfig.I2C_SCLSpeed <= I2C_SCL_SPEED_STD)//If it is Standard Mode
	{
		//Thigh = CCR * TPCLK1
		//Tlow = CCR * TPCLK1
		//This is the formula in Reference Man. More detail look at there
		//When Thigh = Tlow => Tscl = 2 * CCR * TPCLK1 => CCR is going to be like below.
		ccr_value = (RCC_GetPCLK1Value() / ( 2 * pI2CHandle->I2CConfig.I2C_SCLSpeed ) );
		tempreg |= (ccr_value & 0xFFF);// Masking last 12 bit by 0xFFF
	}else
	{
		//Fast Mode
		tempreg |= ( 1 << I2C_CCR_FS ); //Set the corresponding bit for fast mode
		tempreg |= (pI2CHandle->I2CConfig.I2C_FastModeDutyCycle << I2C_CCR_DUTY);
		if(pI2CHandle->I2CConfig.I2C_FastModeDutyCycle == I2C_Fast_Mode_DUTY_2) //When DUTY bit 0
		{
			ccr_value = (RCC_GetPCLK1Value() / ( 3 * pI2CHandle->I2CConfig.I2C_SCLSpeed ) );//Same derivation like STD mode above
		}else//When DUTY bit 1
		{
			ccr_value = (RCC_GetPCLK1Value() / ( 25 * pI2CHandle->I2CConfig.I2C_SCLSpeed ) );
		}
		tempreg |= (ccr_value & 0xFFF); // Masking last 12 bit by 0xFFF
	}
	pI2CHandle->pI2Cx->CCR = tempreg;


	/**************************	I2C_TRISE Configuration *******************************/

	if(pI2CHandle->I2CConfig.I2C_SCLSpeed <= I2C_SCL_SPEED_STD)
	{
		//mode is standard mode

		tempreg = (RCC_GetPCLK1Value() /1000000U) + 1 ;

