lutfullah2011/My-Embedded-Experiences/My Embedded Applications/STM32Cube IDE/000_MY_DRIVERS_000/Src/stm32f100xx_i2c.c
}

/*
 * Used for Slave to request for data from Master device in communication
 * Slave send the datas byte by byte, so only "data" argument is enough
 * Slave applications always be in interrupt mode
 */
void I2C_SlaveSendData(I2C_RegDef_t *pI2C,uint8_t data)
{
	pI2C->DR = data;
}

/*
 * Used for to Slave receive data from Master in communication
 * It returns the data in DR
 * Slave applications always be in interrupt mode
 */
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2C)
{
    return (uint8_t) pI2C->DR;
}




/*
 * I2C Event IRQ handling function for implement to non-blocking communication(Interrupt)
 * There are so many EVENTS that may trigger Interrrupts, It is considered as well inside the function
 * Interrupt handling issued for both master and slave mode(TXE & RXNE part) of a device
 * STOPF event generated at the end of Rx in Slave device
 */
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{

	uint32_t temp1, temp2, temp3;

	temp1   = pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_ITEVTEN) ;
	temp2   = pI2CHandle->pI2Cx->CR2 & ( 1 << I2C_CR2_ITBUFEN) ;

	//Setting temp3 variable to SB flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_SB);
/*****************************************************************************************/
	//1. When interrupt generated by SB(Start Bit) event
	//SB flag in SR1 is only applicable in Master mode. For slave mode SB is always zero though.
	if(temp1 && temp3)
	{
		//In this block, address phases(Read or Write) executed.
		if(pI2CHandle->TxRxState == I2C_BUSY_TX)
		{
			I2C_AddressWrite(pI2CHandle->pI2Cx,pI2CHandle->DevAddr);
		}else if (pI2CHandle->TxRxState == I2C_BUSY_RX )
		{
			I2C_AddressRead(pI2CHandle->pI2Cx,pI2CHandle->DevAddr);
		}
	}
/*****************************************************************************************/

/*****************************************************************************************/
	//2. When interrupt generated by ADDR event
	//Changing temp3 variable to ADDR flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_ADDR);
	//   When master mode : Address is sent
	//	 When Slave mode  : Address matched with own address
	if(temp1 && temp3)
	{
		// interrupt is generated because of ADDR event
		I2C_ClearADDRFlag(pI2CHandle);
	}
/*****************************************************************************************/

/*****************************************************************************************/
	//3. When interrupt generated by BTF(Byte Transfer Finished) event
	//Changing temp3 variable to BTF flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_BTF);
	if(temp1 && temp3)
	{
		//BTF flag is set
		if(pI2CHandle->TxRxState == I2C_BUSY_TX)
		{
			//make sure that TXE is also set .
			if(pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_TXE) )
			{
				//BTF, TXE = 1 ==> This is an indication of closing the communication.
			    //Both SR & DR is empty.
				//Close the communcation if only Txlen is 0
				if(pI2CHandle->TxLen == 0 )
				{
					//1. generate the STOP condition
					if(pI2CHandle->Sr == I2C_DISABLE_SR)
						I2C_GenerateStopCondition(pI2CHandle->pI2Cx);

					//2. reset all the member elements of the handle structure. Application state, len info etc.
					I2C_CloseSendData(pI2CHandle);

					//3. notify the application about transmission complete
					I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_TX_CMPLT);

				}
			}

		}else if (pI2CHandle->TxRxState == I2C_BUSY_RX )
		{
			; // There is nothing to do.
		}
	}
/*****************************************************************************************/

/*****************************************************************************************/
	//4. When interrupt generated by STOPF event
	//Changing temp3 variable to STOPF flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_STOPF);
	//Stop detection(STOPF) flag is applicable only slave mode . For master this flag will never be set
	if(temp1 && temp3)
	{
		//STOPF flag is set
		//We need to Clear the STOPF:
		// 1) Read SR1 == Already done by the code above
		// 2) Write to CR1
		pI2CHandle->pI2Cx->CR1 |= 0x0000; // Writing some unaffected data

		//Notify the application that STOPF is detected
		I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_STOPF);
	}
/*****************************************************************************************/

/*****************************************************************************************/
	//5. When interrupt generated by TXE event
	//Changing temp3 variable to TXE flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_TXE);
	if(temp1 && temp2 && temp3)
	{
		//Check for device mode
		if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL))
		{
			//TXE flag is set, it is a indication of DR is empty.
			//We have to do the data transmission
			if(pI2CHandle->TxRxState == I2C_BUSY_TX)
			{
				I2C_MasterHandleTXEInterrupt(pI2CHandle); //Helper function
			}
		}else
		{
			//slave mode
			//make sure that the slave is really in transmitter mode
		    if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_TRA))
		    {
		    	I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_REQ);
		    }
		}
	}
/*****************************************************************************************/

/*****************************************************************************************/
	//6. When interrupt generated by RXNE event
	//Changing temp3 variable to RXNE flag check
	temp3  = pI2CHandle->pI2Cx->SR1 & ( 1 << I2C_SR1_RXNE);
	if(temp1 && temp2 && temp3)
	{
		//check device mode .
		if(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_MSL))
		{
			//The device is master

			//RXNE flag is set
			if(pI2CHandle->TxRxState == I2C_BUSY_RX)
			{
				I2C_MasterHandleRXNEInterrupt(pI2CHandle);

			}

		}else
		{
			//slave
			//make sure that the slave is really in receiver mode
			if(!(pI2CHandle->pI2Cx->SR2 & ( 1 << I2C_SR2_TRA)))
			{
				I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_RCV);
			}
		}
	}
/*****************************************************************************************/

/*****************************************************************************************/
}




